let users = dynamic(["abc@example.com", "ZYX@example.com"]);
AuditLogs 
| where InitiatedBy.user.userPrincipalName in (users)
| where OperationName has "password"  
| summarize arg_max(TimeGenerated, *) by tostring(InitiatedBy.user.userPrincipalName)
